Функция КорректностьИНН(Знач ИНН, Тип) Экспорт

    Результат = Новый Структура("Корректен, ТекстОшибки", Истина, "");
    
	Если Не ЗначениеЗаполнено(ИНН) Тогда
	    Возврат Результат;
	КонецЕсли;

    ИНН = СокрЛП(ИНН);

    Цифры = "0123456789";
    Для Счетчик = 1 По СтрДлина(ИНН) Цикл
        Символ = Сред(ИНН, Счетчик, 1);
        Если СтрНайти(Цифры, Символ) = 0 Тогда
            Результат.Корректен = Ложь;
            Результат.ТекстОшибки = "ИНН должен состоять только из цифр!";
            Возврат Результат;
        КонецЕсли;
    КонецЦикла;

    Если Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда

        Если СтрДлина(ИНН) <> 10 Тогда
            Результат.Корректен = Ложь;
            Результат.ТекстОшибки = "Для юридического лица ИНН должен иметь длину 10 знаков!";
            Возврат Результат;
        КонецЕсли;

        Веса = Новый Массив;
        Веса.Добавить(2); 
		Веса.Добавить(4); 
		Веса.Добавить(10); 
		Веса.Добавить(3); 
		Веса.Добавить(5);
        Веса.Добавить(9); 
		Веса.Добавить(4); 
		Веса.Добавить(6);  
		Веса.Добавить(8);

        Сумма = 0;
		
        Для Индекс = 0 По 8 Цикл
            Цифра = Число(Сред(ИНН, Индекс + 1, 1));
            Сумма = Сумма + (Цифра * Веса[Индекс]);
        КонецЦикла;

        КонтрольноеЧисло = (Сумма % 11) % 10;
        ПоследняяЦифра   = Число(Прав(ИНН, 1));

        Если КонтрольноеЧисло <> ПоследняяЦифра Тогда
            Результат.Корректен = Ложь;
            Результат.ТекстОшибки = "Некорректное контрольное число ИНН для юридического лица!";
        КонецЕсли;

    Иначе

        Если СтрДлина(ИНН) <> 12 Тогда
            Результат.Корректен = Ложь;
            Результат.ТекстОшибки = "Для физического лица ИНН должен иметь длину 12 знаков!";
            Возврат Результат;
        КонецЕсли;

        Веса11 = Новый Массив;
        Веса11.Добавить(7); 
		Веса11.Добавить(2); 
		Веса11.Добавить(4); 
		Веса11.Добавить(10); 
		Веса11.Добавить(3);
        Веса11.Добавить(5); 
		Веса11.Добавить(9); 
		Веса11.Добавить(4); 
		Веса11.Добавить(6);  
		Веса11.Добавить(8);

        Веса12 = Новый Массив;
        Веса12.Добавить(3); 
		Веса12.Добавить(7); 
		Веса12.Добавить(2); 
		Веса12.Добавить(4);  
		Веса12.Добавить(10);
        Веса12.Добавить(3); 
		Веса12.Добавить(5); 
		Веса12.Добавить(9); 
		Веса12.Добавить(4);  
		Веса12.Добавить(6);  
		Веса12.Добавить(8);

        Сумма11 = 0;
		
		Для Индекс = 0 По 9 Цикл
            Цифра = Число(Сред(ИНН, Индекс + 1, 1));
            Сумма11 = Сумма11 + (Цифра * Веса11[Индекс]);
		КонецЦикла;
		
        КонтрольноеЧисло11 = (Сумма11 % 11) % 10;

        Сумма12 = 0;
		
		Для Индекс = 0 По 10 Цикл
            Цифра = Число(Сред(ИНН, Индекс + 1, 1));
            Сумма12 = Сумма12 + (Цифра * Веса12[Индекс]);
        КонецЦикла;
		
		КонтрольноеЧисло12 = (Сумма12 % 11) % 10;

        Если (КонтрольноеЧисло11 <> Число(Сред(ИНН, 11, 1))) Или (КонтрольноеЧисло12 <> Число(Сред(ИНН, 12, 1))) Тогда
            Результат.Корректен = Ложь;
            Результат.ТекстОшибки = "Некорректное контрольное число ИНН для физического лица!";
        КонецЕсли;

    КонецЕсли;

    Возврат Результат;

КонецФункции