
// Функция - Цена на дату
// Вызывает одноименную серверную функцию из модуля ЦеныСервер для получения стоимости из клиента формы.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Элемент, для которого запрашивается цена.
//  Дата - Дата - Момент времени для расчета цены.
// 
// Возвращаемое значение:
//  Число (ОпределяемыйТип.Сумма) - Полученная с сервера цена товара.
//

Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Возврат ЦеныСервер.ЦенаНаДату(Номенклатура, Дата);
	
КонецФункции

// Функция - Скидка на дату
// Вызывает одноименную функцию из серверного модуля для получения процента скидки на клиенте формы.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Товар для проверки.
//  Дата - Дата - Момент расчета.
// 
// Возвращаемое значение:
//  Число - Процент скидки.
//
Функция СкидкаНаДату(Номенклатура, Дата) Экспорт
	
	Возврат ЦеныСервер.СкидкаНаДату(Номенклатура, Дата);
	
КонецФункции