
&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()
	
	НаборЗаписей = РегистрыСведений.Календарь.СоздатьНаборЗаписей();
	
	ДатаНачала = '20260101';
	ДатаОкончания = '20261231';
	
	ТекущаяДата = ДатаНачала;
	Пока ТекущаяДата <= ДатаОкончания Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.День = ТекущаяДата;
		ДеньНедели = ДеньНедели(ТекущаяДата);
		
		Если ДеньНедели = 6 Или ДеньНедели = 7 Тогда
			НоваяЗапись.Рабочий = 0;
		Иначе
			НоваяЗапись.Рабочий = 1;
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
		
	НаборЗаписей.Записать(Истина);
	
	Сообщить("Календарь за 2026 год успешно заполнен!");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	ЗаполнитьКалендарьНаСервере();
КонецПроцедуры
