
&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Цены);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ОбработатьВыбраннуюНоменклатуру(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ТекЗначение Из ВыбранноеЗначение Цикл
			ОбработатьВыбраннуюНоменклатуру(ТекЗначение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыбраннуюНоменклатуру(ВыбранныйТовар)
	
	ПараметрыПоиска = Новый Структура("Номенклатура", ВыбранныйТовар);
	НайденныеСтроки = Объект.Цены.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Объект.Цены.Добавить();
		НоваяСтрока.Номенклатура = ВыбранныйТовар;
		ПриИзмененииНоменклатуры(НоваяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Цены.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииНоменклатуры(ТекущаяСтрока);
	КонецЕсли
	
КонецПроцедуры
