
Процедура ВыполнитьПоручениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		
		ФормируемаяЗадача.Наименование = НаименованиеЗадачи;
		ФормируемаяЗадача.ПодробноеОписание = ПодробноеОписание;
		
		ФормируемаяЗадача.Исполнитель = ?(ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Сотрудники"), Исполнитель, Неопределено);
		ФормируемаяЗадача.Роль = ?(ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Роли"), Исполнитель, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры
