
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Скидки.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Скидки Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата; 
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрока.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрока.Скидка;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры
