
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Товары.Очистить();
	Движения.Управленческий.Очистить();
	
	Движения.Товары.Записать();
	Движения.Управленческий.Записать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	РеализацияТоварыИУслуги.Номенклатура.Тип КАК ТипНоменклатуры,
		|	СУММА(РеализацияТоварыИУслуги.Количество) КАК КоличествоПродажи,
		|	СУММА(РеализацияТоварыИУслуги.Сумма) КАК СуммаВыручки
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоварыИУслуги
		|ГДЕ
		|	РеализацияТоварыИУслуги.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоварыИУслуги.Номенклатура,
		|	РеализацияТоварыИУслуги.Номенклатура.Тип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыДокумента.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВТ_ТоварыДокумента.КоличествоПродажи КАК КоличествоПродажи,
		|	ВТ_ТоварыДокумента.СуммаВыручки КАК СуммаВыручки,
		|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК НакоплениеКоличествоОстаток,
		|	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК НакоплениеСуммаОстаток,
		|	ЕСТЬNULL(БухОстатки.КоличествоОстаток, 0) КАК БухКоличествоОстаток,
		|	ЕСТЬNULL(БухОстатки.СуммаОстаток, 0) КАК БухСуммаОстаток
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(&МоментВремени, Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_ТоварыДокумента КАК ВТ)) КАК ТоварыОстатки
		|		ПО ВТ_ТоварыДокумента.Номенклатура = ТоварыОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
		|				&МоментВремени,
		|				Счет = &СчетТовары,
		|				,
		|				Субконто1 В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_ТоварыДокумента КАК ВТ)) КАК БухОстатки
		|		ПО ВТ_ТоварыДокумента.Номенклатура = БухОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетТовары", ПланыСчетов.Управленческий.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Если Выборка.КоличествоПродажи > Выборка.НакоплениеКоличествоОстаток Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка списания УУ! Не хватает товара %1 в регистре накопления в количестве %2 шт. (Доступно: %3)", 
					Выборка.Номенклатура, Выборка.КоличествоПродажи - Выборка.НакоплениеКоличествоОстаток, Выборка.НакоплениеКоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи > Выборка.БухКоличествоОстаток Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка списания БУ! Не хватает товара %1 на счете 41 Управленческий в количестве %2 шт. (Доступно: %3)", 
					Выборка.Номенклатура, Выборка.КоличествоПродажи - Выборка.БухКоличествоОстаток, Выборка.БухКоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи = Выборка.НакоплениеКоличествоОстаток Тогда
				СебестоимостьНакопление = Выборка.НакоплениеСуммаОстаток;
			Иначе
				СебестоимостьНакопление = (Выборка.НакоплениеСуммаОстаток / Выборка.НакоплениеКоличествоОстаток) * Выборка.КоличествоПродажи;
				СебестоимостьНакопление = Окр(СебестоимостьНакопление, 2);
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи = Выборка.БухКоличествоОстаток Тогда
				СебестоимостьБух = Выборка.БухСуммаОстаток;
			Иначе
				СебестоимостьБух = (Выборка.БухСуммаОстаток / Выборка.БухКоличествоОстаток) * Выборка.КоличествоПродажи;
				СебестоимостьБух = Окр(СебестоимостьБух, 2);
			КонецЕсли;
			
			Движение = Движения.Товары.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.КоличествоПродажи;
			Движение.Сумма = СебестоимостьНакопление; 
			
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Сумма = СебестоимостьНакопление;
			
			ПроводкаСписание = Движения.Управленческий.Добавить();
			ПроводкаСписание.Период = Дата;
			ПроводкаСписание.СчетДт = ПланыСчетов.Управленческий.Расходы;
			ПроводкаСписание.СчетКт = ПланыСчетов.Управленческий.Товары;
			ПроводкаСписание.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ПроводкаСписание.КоличествоКт = Выборка.КоличествоПродажи;
			ПроводкаСписание.Сумма = СебестоимостьБух;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ДвижениеДоходы = Движения.Доходы.Добавить();
			ДвижениеДоходы.Период = Дата;
			ДвижениеДоходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеДоходы.Количество = Выборка.КоличествоПродажи;
			ДвижениеДоходы.Сумма = Выборка.СуммаВыручки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтотОбъект.Сумма > 0 И НЕ Отказ Тогда
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Контрагент = Покупатель;
		Движение.Сумма = ЭтотОбъект.Сумма;
		
		ПроводкаВыручка = Движения.Управленческий.Добавить();
		ПроводкаВыручка.Период = Дата;
		ПроводкаВыручка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		ПроводкаВыручка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
		ПроводкаВыручка.СчетКт = ПланыСчетов.Управленческий.Выручка;
		ПроводкаВыручка.Сумма = ЭтотОбъект.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

