
&НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока)
	
	ОбъектОтбора = ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа;
	
	Если ЗначениеЗаполнено(ОбъектОтбора) И ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.Номенклатура") Тогда
		// Просто передаем дату из шапки, сервер сам разберется с ней
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ОбъектОтбора, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Скидки.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииНоменклатурыНоменклатурнойГруппы(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры