
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Получатель) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан получатель денежных средств! Проведение отменено.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.Сумма = Сумма;
	Проводка.СчетКт = ПланыСчетов.Управленческий.ДенежныеСредства;
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Контрагент = Получатель;
		Движение.Сумма = Сумма;
		
		Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Получатель;
		
	ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Получатель;
		
	КонецЕсли;
	
КонецПроцедуры


