Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	НачалоПериодаДействия = НачалоМесяца(ЗаМесяц);
	КонецПериодаДействия = КонецМесяца(ЗаМесяц);
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Для Каждого ТекСтрока Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ОплатаПоОкладу;
		
		Движение.ПериодДействияНачало = НачалоПериодаДействия;
		Движение.ПериодДействияКонец = КонецПериодаДействия;
		
		Движение.Сотрудник = ТекСтрока.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ЗарплатаДанныеГрафика.Сотрудник.Оклад, 0) КАК Оклад,
	|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийПериодДействия, 0) КАК План,
	|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.Зарплата.ДанныеГрафика(Регистратор = &Регистратор) КАК ЗарплатаДанныеГрафика";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.План = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Сотруднику %1 невозможно рассчитать оклад: не заполнен график работы (План = 0)!", Выборка.Сотрудник);
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
		РассчитаннаяСумма = Выборка.Оклад * Выборка.Факт / Выборка.План;
		РассчитаннаяСумма = Окр(РассчитаннаяСумма, 2);
		
		Движение.Сумма = РассчитаннаяСумма;
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Сумма = РассчитаннаяСумма;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
