Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Записывать = Истина;
	Движения.Зарплата.Очистить();
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	
	НачалоРасчетногоПериода = НачалоМесяца(ЗаМесяц);
	КонецРасчетногоПериода = КонецМесяца(ЗаМесяц);
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом;
		Движение.ПериодДействияНачало = НачалоРасчетногоПериода;
		Движение.ПериодДействияКонец = КонецРасчетногоПериода;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = НачалоРасчетногоПериода;
		Движение.БазовыйПериодКонец = КонецРасчетногоПериода;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	РасчетПремииПроцентом();
	
КонецПроцедуры

Процедура РасчетПремииПроцентом()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаБазаЗарплата.Сотрудник КАК Сотрудник,
	|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза
	|ИЗ
	|	РегистрРасчета.Зарплата.БазаЗарплата(&Измерения, &Измерения, , Регистратор = &Регистратор И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.ПремияПроцентом);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
		
		Результат = Выборка.СуммаБаза * Процент / 100;
		Результат = Окр(Результат, 2);
		Движение.Сумма = Результат;
		
		Если Результат > 0 Тогда
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.Сумма = Результат;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры


