Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Записывать = Истина;
	Движения.Зарплата.Очистить();
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеСотрудники.Сотрудник КАК Сотрудник,
	|	СУММА(НачислениеСотрудники.Сумма) КАК Сумма
	|ИЗ
	|	Документ.НачислениеСписком.Сотрудники КАК НачислениеСотрудники
	|ГДЕ
	|	НачислениеСотрудники.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	НачислениеСотрудники.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДвижениеРасчет = Движения.Зарплата.Добавить();
		ДвижениеРасчет.ПериодРегистрации = ПериодРегистрации;
		ДвижениеРасчет.ВидРасчета = Начисление;
		ДвижениеРасчет.ПериодДействияНачало = ПериодДействияНачало;
		ДвижениеРасчет.ПериодДействияКонец = ПериодДействияКонец;
		ДвижениеРасчет.Сотрудник = Выборка.Сотрудник;
		ДвижениеРасчет.Сумма = Выборка.Сумма;
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Сумма = Выборка.Сумма;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
		
	КонецЦикла;
	
КонецПроцедуры

