
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	
	СгенерироватьСлучайныйПароль();
	
КонецПроцедуры  

&НаСервере
Процедура СгенерироватьСлучайныйПароль()
	
	ГенераторПароля = Новый ГенераторСлучайныхПаролей();
	СгенерированныйПароль = ГенераторПароля.СлучайныйПароль(6, Ложь);
	Пароль = СгенерированныйПароль;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИдентификаторПользователяИБ = ТекущийОбъект.ИдентификаторПользователяИБ;
    ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
    
    Если ПользовательИБ <> Неопределено Тогда
        ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
        ИмяДляВхода = ПользовательИБ.Имя;
    Иначе
        ВходРазрешен    = Ложь;
        ИмяДляВхода     = "";
    КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ИдентификаторПользователяИБ = ТекущийОбъект.ИдентификаторПользователяИБ;
    ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
    
    Если ПользовательИБ = Неопределено И ВходРазрешен Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        ПользовательИБ.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
    КонецЕсли;
    
    Если ПользовательИБ <> Неопределено Тогда
        ПользовательИБ.Имя = ИмяДляВхода;
        ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
        ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
        ПользовательИБ.Пароль = Пароль; 
        ПользовательИБ.Записать();
        ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры




