
&НаСервере
Процедура ПринятьКИсполнениюНаСервере(ТекущаяЗадачаСсылка)
	
	ЗадачаОбъект = ТекущаяЗадачаСсылка.ПолучитьОбъект();
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.ТекущийСотрудник;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПринятьКИсполнениюНаСервере(ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
	
КонецПроцедуры


